# -*- coding: utf-8 -*-

good_chars = [
    u'ă', u'â', u'î', u'ț', u'ș',
    u'Ă', u'Â', u'Ț', u'Ș', u'Î',
    u'”', u'„', u'—', u'«', u'»',
    u'≤', u'±', u'Σ', u'•', u'§',
    u'á', u'−', u'¹', u'ö', u'é',
    u'ó', u'ő', u'’', u'ä', u'š',
    u'č', u'‰', u'ü', u'ï', u'í',
    u'Á', u'É', u'è', u'□', u'ç',
    u'α', u'γ', u'β', u'δ', u'ф',
    u'ǿ', u'Ö', u'°', u'ʼ', u'®',
    u'≥', u'λ', u'à', u'ρ', u'Ω',
]

chars_mapping_2000 = {
    u'Ã': u'Ă',
    u'ã': u'ă',
    u'º': u'ș',
    u'Ð': u'-',
    u'ä': u'‰',
    u'”': u'"',
    u'Ç': u'«',
    u'È': u'»',
}

chars_mapping_2008 = {
    u'“': u'”',
    u'ǎ': u'ă',
    u'܊': u'ț',
    u'º': u'o',
    u'ȃ': u'ă',
}

chars_mapping = {
    #2005
    u'√': u'Ă',
    u'¬': u'Â',
    u'™': u'Ș',
    u'‚': u'â',
    u'∫': u'ș',
    u'„': u'ă',
    u'˛': u'ț',
    u'Ó': u'î',
    u'ﬁ': u'Ț',
    u'“': u'”',
    u'Œ': u'Î',
    u'ˆ': u'Ă',
    u'´': u'Â',
    u'Ñ': u'—',
    u'ª': u'ă',
    u'þ': u'ț',
    u'Þ': u'Ț',
    u'¥': u'•',
    u'Ò': u'”',
    u'ã': u'ă',
    #recente
    u'\xc8\x98': u'Ș',
    u'\xc8\x9a': u'Ț',
    u'\xc8\x9b': u'ț',
    u'\xc8\x99': u'ș',
    u'\xc7\x8e': u'ă',
    u'\xe2\x80\x93': u'—',
    u'\xef\xbf\xbd': u'...',
}
